#+BEGIN_EXPORT html
---
layout: page
title: Tasks management
tagline: "How use your time more effectevily"
permalink: /meta-learning/tasks-management.html
categories: [Learning Methodology, Org-mode]
tags: [agenda, tasks-management]
---
#+END_EXPORT

#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval no-export
#+CATEGORY: TM
#+TODO: | AMPLE
#+TODO: RAW INIT TODO ACTIVE | DONE
#+TODO: DELAY LAG RETARD | BARE

* DELAY Preface
SCHEDULED: <2024-03-10 Sun>
:LOGBOOK:
CLOCK: [2024-01-31 Wed 13:01]--[2024-01-31 Wed 13:14] =>  0:13
CLOCK: [2024-01-30 Tue 08:33]--[2024-01-30 Tue 09:20] =>  0:47
CLOCK: [2024-01-26 Fri 12:19]--[2024-01-26 Fri 12:38] =>  0:19
:END:

Task management is defined as a system for efficient planning and
execution of tasks, ensuring a streamlined path to successful
completion. Is the process of managing a task or many tasks through
its lifecycle from inception to execution. It is a way of planning and
handling tasks from the moment you put them into a schedule until
they're completed or accomplish. Task management skills are the
abilities that help you achieve goals, work efficiently and take full
advantage of your time. It is embraces several key activities like
planning, workflow customization, tracking, managing and
reporting. Effective task management is the cornerstone of
productivity and requires overseeing all aspects of a task, including
its status, priority, time, human and financial resource assignments,
dependencies etc.

Managing tasks at work requires understanding of task management
techniques like Tasks scheduling, To-do lists, Prioritize tasks,
Breakdown tasks into smaller chunks, Working log performance, Make
changes.

* RAW Tasks classification
SCHEDULED: <2024-02-29 Thu>
:LOGBOOK:
CLOCK: [2024-02-09 Fri 06:29]--[2024-02-09 Fri 07:14] =>  0:45
CLOCK: [2024-01-30 Tue 09:20]--[2024-01-30 Tue 09:39] =>  0:19
:END:

- Main classes;
- Classes definition (purpose, distinction features);

  #+begin_quote
  "I have two kinds of problems: the urgent and the important.  The
  urgent are not important, and the important are never urgent."
  ------ Dr. J. Roscoe Miller, president of Northwestern University
  #+end_quote

The main tasks classes are:

Class I - by urgency and importancy:

The great time management means being effective as well as
efficient. In other words, we must spend our time on things that are
important and not just the ones that are urgent. To do this, and to
minimize the stress of having too many tight deadlines, we need to
understand this distinction:

*Important* activities have an outcome that leads to us achieving our
goals, whether these are professional or personal.

*Urgent* activities demand immediate attention, and are usually
associated with achieving someone else's goals.

When we know which activities are important and which are urgent, we
can overcome the natural tendency to focus on unimportant urgent
activities, so that we can clear enough time to do what's essential
for our success. This is the way we move from "firefighting" into a
position where we can grow our goals.

*Urgent and important* - they are demand your attention and action
/right now/. There are two distinct types of urgent and important
activities: ones that you could not have foreseen, and others that
you've left until the last minute. You can eliminate last-minute
activities /by planning ahead and avoiding procrastination/;

*Important, but not urgent* - they are essential issues, but they’re
not urgent and don’t require your immediate action. These are the
activities that help you achieve your personal and professional goals,
and complete important work. So these are the items you’ll want /to
schedule for a future work/. But /make sure/ that you /have plenty of
time to do these things properly/, so that they do not become urgent;

*Not important, but urgent* - these are urgent items /that pop up/ and
/demand immediate attention/. Urgent but not important tasks are
things that prevent you from achieving your goals. A common source of
such activities is other people. Sometimes it's appropriate to say
"no" to people politely, or to encourage them to solve the problem
themselves;

*Not important, not urgent* - they are not essential or urgent, so you
can, in most cases, /delay them or delete from your list/.

Class II - Chores:

It is regular, trivial, banal, routine tasks that important to do
everyday or in particular day.

Class III - by dependency:

Related or Not related

Tasks whose execution depends on each other are considered *related*.
Сompleting one of these tasks in most cases is the key to completing
the other task.

Class lV:
Tasks are also differentiated by complexity, from low to
high:

Complex or simple

*Complex* task can have many different and connected parts, and is
therefore often difficult to understand;

*Simple* is a task that easily understand or done and presenting no
difficulty.

Class V:
By gestation stages:

RAW Init DP0 Todo DP1 Active DONE

* RAW Org-Agenda as the main tool of capabilities
SCHEDULED: <2024-02-27 Tue>
:LOGBOOK:
CLOCK: [2024-02-09 Fri 07:18]--[2024-02-09 Fri 10:06] =>  2:48
CLOCK: [2024-02-06 Tue 11:20]--[2024-02-06 Tue 11:56] =>  0:36
CLOCK: [2024-02-02 Fri 10:35]--[2024-02-02 Fri 11:22] =>  0:47
CLOCK: [2024-02-01 Thu 08:45]
:END:

We all have the some experience with different project management
application. Each have their own advantages, but unfortunately doesn't
always meet out expectation. Org-mode's built-in summary view known as
org-agenda is the incredible powerful tool for everyday task managing.
It allows to effectively log your time and provides an easy plain-text
interface to quickly gathering notes and organize your thoughts.

The guide contains an overwhelming amount of useful information.
[[https://doc.norang.ca/org-mode.html][Guide be Bernt Hansen ]]

** =TODO= Keywords

At its core, the workflow with Org is build around the idea of working
through projects, which are set up as a series of “TODO” items which
describe the task's lyfecycle. Without any customization, Org allows
you to assign a “TODO” or a “DONE” status to any heading. TODO Used to
indicate tasks and projects which need to get done and describe task's
work phase.

In my everyday work I use the next TODO's chains:
#+begin_example
#+TODO: | AMPLE
#+TODO: RAW Init DP0 Todo DP1 Active | DONE
#+TODO: DELAY LAG RETARD | BARE
#+end_example

** The Agenda

The Agenda view scans your .org files (set by customizing the
org-agenda-files variable) and collects all of the headings with a
TODO (or related) keyword. The agenda provides a convenient way of
tracking your projects and managing your calendar.





#+begin_quote
[[https://cachestocaches.com/2016/9/my-workflow-org-agenda/]]
[[https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html]]

I want to describe how to use org-mode's agenda with scheduled items
and basic TODO because I find org-mode's Agenda the incredibly
powerful tool for everyday task managing.

[[https://doc.norang.ca/org-mode.html][Guide be Bernt Hansen ]]

However, the guide contains an overwhelming
amount of useful information.

I use org-mode (or simply “Org”) for pretty much everything. I rely on
it to keep track of my notes for work and hobby projects. I keep track
of my upcoming tasks. It serves me with reminders for things like
upcoming meetings and people I need to send emails to. And it acts as a nice
medium in which to implement many of the principles by the well-known
productivity book "Getting Things Done".

TODO Keywords

At its core, my workflow with Org is build around the idea of working
through projects, which are set up as a series of “todo”
items. Without any customization, Org allows you to assign a “TODO” or
a “DONE” status to any heading.

TODO Used to indicate tasks and projects which need to get done (a
 “project” is any “TODO” heading with other “TODO/NEXT/DONE” headings
 underneath it).
 
NEXT This is for tasks which are to be done “next” within a particular
 project. Following the Getting Things Done principles, a project
 without a task marked as “NEXT” is considered “stuck” (but more on
 that in the next section).
 
WAITING Whenever I have a task that is waiting on someone else, I’ll
 assign it this keyword.
 
INACTIVE As an academic, I will occasionally have ideas or projects
 that I’ll want to get done eventually, but won’t have time to work on
 them at the moment. I typically use the INACTIVE keyword to signify
 that I’d like to come back to it eventually and I’ll occasionally
 search my files for “INACTIVE” projects when I have time.
 
CANCELLED This is self-explanatory. If I’m working on something for a
 while, but it fizzles, it’s sometimes useful to mark it as cancelled.
 
MEETING Used to indicate that I was meeting with someone. I’ll put
 meeting notes in headings with this keyword.
 
DONE Again, this is self-explanatory.


The Agenda

My favorite thing by far about using Org to collect my thoughts and
keep track of my active projects is the agenda view:

A demo agenda view with some sample content. As you can imagine (if
you’re even half as busy as I am), my full agenda view contains tasks
from a host of different projects and files and my clock-view (at the
top of the agenda) will often fill my screen by the end of the
day. The agenda makes it easy to see what tasks or meetings I have
coming up for the rest of the day and provides an easy interface for
choosing what task to tackle next.  Scrolling down to the item of
interest and pressing return will automatically take you to it, adding
to the convenience.



I’ve put quite a bit of work into getting the agenda to behave the way
I want. At the top of the agenda is my “Today” view, which shows all
of my appointments and deadlines for the day, as well as all of my
clocked tasks (which I’ll talk more about in the next section.  Then,
I include all tasks marked as “NEXT”, which, once I’ve worked through
all my items with deadlines, gives me other high priority tasks to
chose from. I also have additional views for seeing my different
active projects and other tasks associated with those projects.

I mentioned in the previous section that tags were useful, but its
really in the agenda that this feature shines through. Pressing / in
the agenda enables “filtering by tag”, so that only certain tags are
shown (or excluded using -). Furthermore, there are ways (see Bernt’s
guide for more info) to ensure that your “personal” tags are
automatically filtered out during the work day, so that you don’t have
to worry about pruning them yourself.

A similar sort of search of the text using regular expressions can be
performed by pressing =.

A similar sort of search of the text using regular expressions can be
performed by pressing =.

Automatic Clocking

Certainly having a way of viewing one’s appointments is nice, but
what’s an agenda without some way of logging one’s time? Fortunately,
Org has you covered once again, which has some extremely useful
clocking functionality built-in. Using it is relatively
straightforward, with only a couple of key bindings to remember for
clocking in (C-c C-x C-i) and clocking out (C-c C-x C-o).

There are a few additional niceties which make this all worth
doing. First, changing the state of the currently clocked task will
clock out the time, which saves you from having to worry about it when
you close out a task. As you might expect, the clocked entries will
appear in your agenda view (as in the image above). The agenda view
will also include the currently clocked task in the time-grid,
allowing you to quickly change its state or clock out.

During a typical day at work, I rely on all of these tools for project
management. After spending some time in the morning reviewing my
agenda and re-organizing my projects (if necessary), I start by
tackling my upcoming deadlines and tasks which are marked for today.
Once those are taken care of, I’ll chose a NEXT task (typically one
with a :WORK: tag) and try to eliminate as many as possible before
going home. When I’m interrupted by meetings, I start a MEETING with
“Capture”. Whenever I have thoughts about something else I need to
accomplish, whether work-related or not, I use “Capture” again. Though
I’m far from proficient at this, I always try to clock my time and, at
the end of each day, I’ll review how effectively I’m focusing my
effort.
#+end_quote

* Group your tasks into bundles
* Assign your tasks to a particular date/time
* Final preparation
